//************************************************************************************************
// Project MAXI32 GRTOS
// Author: Andrew Doynikov
// 15.08.2012
//************************************************************************************************
// RUSSIAN LANG FILE
//************************************************************************************************

#include "lcd_lib.h"

char *dw[] = {"ПН","ВТ","СР","ЧТ","ПТ","СБ","ВС"};
char *logo[] = {
//012345678901234567890
 "ZALMAN HD503",
 "Версия : FINAL 4",
 "DS18x20:    ДАТЧ"
};
#define LOGO_1     0
#define LOGO_2     1
#define LOGO_3     2
//************************************************************************************************
#if (LCD_TYPE == LCD20x4)
char *msg[] = {
//012345678901234567890
 "ВЫКЛЮЧЕНО",
 "АКУСТИКА ",
 " СЕК",
 "ВКЛ ",
 "ВЫКЛ",
 "ЗВУК ВЫКЛЮЧЕН",
 "---.--",
 "MHz",
 "УСТАНОВКА",
 "ПАРАМЕТРОВ",
 "ВХОД: ",
 "СТАНЦИЯ: ",
 "АВТО",
 "СТАНЦИЯ:",
 "КНОПКА ",
 " ТРЕБУЕТСЯ",
 "ПЕРЕЗАГРУЗКА",
 "ВХОД",
 "ПИСК",
 "ПРМ",
 "ДА ",
 "НЕТ",
 "RC5 КНОПКА УЖЕ ЕСТЬ"
};
#endif
#if (LCD_TYPE == LCD16x4)
char *msg[] = {
//012345678901234567890
 "ВЫКЛЮЧЕНО",
 "АКУСТИКА ",
 " СЕК",
 "ВКЛ",
 "ВЫК",
 "ЗВУК ВЫК",
 "---.--",
 "MHz",
 "УСТАНОВКА",
 "ПАРАМЕТРОВ",
 "ВХОД: ",
 "СТАНЦИЯ: ",
 "АВТ",
 "СТАН:",
 "КНОП ",
 " ТРЕБУЕТСЯ",
 "ПЕРЕЗАГРУЗКА",
 "ВХОД",
 "ПИСК",
 "ПРМ",
 "ДА ",
 "НЕТ",
 "КНОПКА УЖЕ ЕСТЬ"
};
#endif
#define MSG_STANDBY		0
#define MSG_AC		 	1
#define MSG_SEC		 	2
#define MSG_ON		 	3
#define MSG_OFF		 	4
#define MSG_MUTE	 	5
#define MSG_FREQ	 	6
#define MSG_MHZ		 	7
#define MSG_OMENU	 	8
#define MSG_OMENU1	 	9
#define MSG_SELECT	 	10
#define MSG_CH	 		11
#define MSG_AVTO 		12
#define MSG_STAN 		13
#define MSG_KNOPKA 		14
#define MSG_PEREZ1 		15
#define MSG_PEREZ2 		16
#define MSG_IN  		17
#define MSG_PISK  		18
#define MSG_000  		19
#define MSG_DA  		20
#define MSG_NET  		21
#define MSG_RC5_DUBLE   22
//************************************************************************************************
#if (LCD_TYPE == LCD20x4)
#define AMENU_MAX 4
char *alarmmenu[] = {
//0123456789ABCDEF0123
 "БУДИЛЬНИК:",
 "ВРЕМЯ    :",
 "ТИП БУД. :",
// "ВХОД     :",
 "ДЛИТЕЛЬН.:",
// "ПОСЛЕ ВЫК:",
 "БУДИЛ ВЫК:"
};
#endif
//************************************************************************************************
#if (LCD_TYPE == LCD16x4)
#define AMENU_MAX 4
char *alarmmenu[] = {
//0123456789ABCDEF0123
 "БУДИЛ:",
 "ВРЕМЯ:",
 "ТИП  :",
// "ВХОД :",
 "ДЛИТ.:",
// "П.ВЫК:",
 "Б.ВЫК:"
};
#endif
//************************************************************************************************
#define SET_ALARM_ON_OFF 0
#define SET_ATIME        1
#define SET_ATYPE        2
//#define SET_AINPUT       3
#define SET_AMIN         3
//#define SET_APOSLE       5
#define SET_ABUD         4
#define ALARM_ON_OFF     0
#define ALARM_H          1
#define ALARM_M          2
#define ALARM_TYPE       3
#define ALARM_INPUT      4
#define ALARM_MINUT      5
#define ALARM_POSLE      6
#define ALARM_BUD        7
#define ALARM_MIN        1
#define ALARM_MAX        4
//************************************************************************************************
#define SELECT_MAX     2
char *select[] = {
"PC ",
"DVD",
"FM "
};
#define MSG_SELECT_1   0
#define MSG_SELECT_2   1
#define MSG_SELECT_3   2
//************************************************************************************************
#define MMENU_MAX 7
char *mainmenu[] = {
//012345678901234567890
 "ГРОМ:", // 1
 "УСИЛ:", // 2
 "НЧ  :", // 3
 "ВЧ  :", // 4
 "ФР L:", // 5
 "ФР R:", // 6
 "ТЛ L:", // 7
 "ТЛ R:"  // 8
};
#define MM_VOLUME      0
#define MM_ATTENS      1
#define MM_BASS        2
#define MM_TREBLE      3
#define MM_ATTENS_FL   4
#define MM_ATTENS_FR   5
#define MM_ATTENS_RL   6
#define MM_ATTENS_RR   7
#define MM_MAIN        8
#define MM_FMRADIO     9
#define MM_OPTMENU     10
//************************************************************************************************
#if (LCD_TYPE == LCD20x4)
#define OMENU_MAX 11
char *optionmenu[] = {
//0123456789ABCDEF0123
 "ВРЕМЯ: ",
 "ДАТА : ",
 "УСТ. БУДИЛ.> ",
 "FM СТАНЦИИ > ",
 "RC5 KЛАВИШИ> ",
 "ВНЕШ. КЛАВ.> ",
 "MAKC. TЕМП.: ",
 "ВРЕМЯ ОЖИД.: ",
 "ВЫХОД STB  : ",
 "ЗАДЕРЖКА АС: ",
 "КОД ПУЛЬТА : ",
 "ПОДСВЕТКА  : "
};
#endif
//************************************************************************************************
#if (LCD_TYPE == LCD16x4)
#define OMENU_MAX 11
char *optionmenu[] = {
//01234567890123456789
 "ВРЕМЯ:",
 "ДАТА :",
 "УСТ.БУДИЛ >",
 "FM СТАНЦ. >",
 "RC5 KЛАВ. >",
 "ВНЕШ.КЛАВ.>",
 "MAKC.TЕМП.:",
 "ВРЕМЯ ОЖИД:",
 "ВЫХОД STB :",
 "ЗАДЕР. АС :",
 "КОД RC5   :",
 "ПОДСВЕТКА :"
};
#endif
//************************************************************************************************
#define SET_TIME        0
#define SET_DATE        1
#define SET_ALARM       2
#define SET_FM_CHANEL   3
#define SET_RC5_KEY     4
#define SET_EXT_KEY     5
#define SET_MAX_TEMP    6
#define SET_NOKEY       7
#define SET_STB_OUT     8
#define SET_AC_WAIT     9
#define SET_RC5_SYSTEM  10
#define SET_LIGHT_LCD   11
//************************************************************************************************
#if (LCD_TYPE == LCD20x4)
#define RC5_MENU_MAX 23
char *rc5_menu[] = {
//0123456789ABCDEF0123
//**************00:??*
 "ВКЛЮЧЕНИЕ :",
 "ВЫБОР     :",
 "ВЫКЛ.ЗВУК :",
 "ВВЕРХ     :",
 "ВНИЗ      :",
 "ВЛЕВО     :",
 "ВПРАВО    :",
 "MЕНЮ      :",
 "ТОНКОМПЕН.:",
 "ВЫБОР ВХОД:",
 "КНОПКА 1  :",
 "КНОПКА 2  :",
 "КНОПКА 3  :",
 "КНОПКА 4  :",
 "КНОПКА 5  :",
 "КНОПКА 6  :",
 "КНОПКА 7  :",
 "КНОПКА 8  :",
 "КНОПКА 9  :",
 "БАНК СТАН :",
 "НЧ -      :",
 "НЧ +      :",
 "ВЧ -      :",
 "ВЧ +      :"
};
#endif
//************************************************************************************************
#if (LCD_TYPE == LCD16x4)
#define RC5_MENU_MAX 23
char *rc5_menu[] = {
//0123456789ABCDEF0123
//**********00:??*
 "ВКЛЮЧЕН.:",
 "ВЫБОР   :",
 "ВЫК.ЗВУК:",
 "ВВЕРХ   :",
 "ВНИЗ    :",
 "ВЛЕВО   :",
 "ВПРАВО  :",
 "MЕНЮ    :",
 "ТОНКОМП.:",
 "ВЫБ.ВХОД:",
 "КНОПКА 1:",
 "КНОПКА 2:",
 "КНОПКА 3:",
 "КНОПКА 4:",
 "КНОПКА 5:",
 "КНОПКА 6:",
 "КНОПКА 7:",
 "КНОПКА 8:",
 "КНОПКА 9:",
 "БАНК СТ.:",
 "НЧ -    :",
 "НЧ +    :",
 "ВЧ -    :",
 "ВЧ +    :"
};
#endif
//************************************************************************************************
#define EXT_MENU_MAX 9
char *ext_menu[] = {
//0123456789ABCDEF0123
//КНОПКА*1****000:???*
//КНОП*1**000:???*
 "1",
 "2",
 "3",
 "4",
 "5",
 "6",
 "7",
 "8",
 "9",
 "БАНК ",
};
//************************************************************************************************



